[
  {
    "name": "Audio-visual techniques and media production",
    "description": "Within the Arts and Humanities broad field, specifically under Arts, this involves the study of techniques and skills for producing various media such as books, newspapers, radio or TV programmes, films, videos, recorded music, and graphic reproductions. It includes methods of colour reproduction, photography, and computer graphics. [cite: 64, 65, 66]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Animation",
    "description": "A component of Audio-visual techniques and media production focused on creating moving images and visual effects using various techniques, often for film, television, games, or interactive media. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Bookbinding",
    "description": "The craft and techniques involved in physically assembling and binding books, as part of Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Camera operating",
    "description": "Skills and techniques for operating cameras in the production of film, video, or television, within Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Compositing (printing)",
    "description": "In the context of printing within Audio-visual techniques and media production, this refers to the process of arranging type and visual elements for printing. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Computer game production",
    "description": "The study and practice of creating computer games, encompassing design, development, and technical aspects, under Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Computer type-setting",
    "description": "The use of computers to set type for print media, a skill within Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Film and video production",
    "description": "The comprehensive process of creating films and videos, from concept to final product, as part of Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Graphic design",
    "description": "The art and practice of planning and projecting ideas and experiences with visual and textual content, often for print or digital media, within Audio-visual techniques and media production. [cite: 65, 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Graphic reproduction",
    "description": "Techniques and processes for reproducing graphic images, a key aspect of Audio-visual techniques and media production. [cite: 65, 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Illustration",
    "description": "Creating visual representations to clarify or adorn textual content, used in various media produced under Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Interactive media design",
    "description": "The design of media that responds to user actions, such as websites or interactive installations, falling under Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Media techniques",
    "description": "The various technical methods and skills used in the production of different forms of media, as studied in Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Multimedia production",
    "description": "The creation of content that uses a combination of different content forms such as text, audio, images, animation, video and interactive content, a part of Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Photography",
    "description": "The art, application, and practice of creating durable images by recording light, studied within Audio-visual techniques and media production. [cite: 65, 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Pre-press operations",
    "description": "The processes and procedures that occur between the creation of a print layout and the final printing, a stage in Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Print finishing and binding",
    "description": "The final stages in the printing process, including cutting, folding, assembling, and binding printed materials, as part of Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Printing",
    "description": "The process of reproducing text and images using a master form or template, a core technique in Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Publishing design, lay-out",
    "description": "The design and arrangement of content (text and images) for publications like books and magazines, a skill within Audio-visual techniques and media production. [cite: 66, 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Radio and TV production",
    "description": "The process of creating content for radio and television broadcast, covered under Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Recorded music production",
    "description": "The process of developing, creating, and refining recorded music for public presentation, as part of Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sound techniques",
    "description": "The technical methods and skills related to recording, manipulating, and reproducing sound, used in Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Type-setting",
    "description": "The process of arranging type for printing, a fundamental skill in Audio-visual techniques and media production. [cite: 67]",
    "wiki": "",
    "resources": []
  }
]