[
  {
    "name": "Fashion, interior and industrial design",
    "description": "Within the Arts, this field is the study of creatively combining line, form, and materials in designing and constructing items like fashion garments, industrial products, and interiors. [cite: 69, 70]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Costume design",
    "description": "The creation of clothing and accessories for performers in theatre, film, or television, a specialization within Fashion, interior and industrial design. [cite: 70]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Design of industrial products",
    "description": "Focuses on the artistic and functional design of manufactured goods, a part of Fashion, interior and industrial design. [cite: 70]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Fashion design",
    "description": "The art of applying design, aesthetics, and natural beauty to clothing and accessories, a core component of Fashion, interior and industrial design. [cite: 70]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Interior architecture",
    "description": "The design of interior spaces, focusing on architectural aspects, structural elements, and space planning, as part of Fashion, interior and industrial design. [cite: 70]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Interior design",
    "description": "The art and science of enhancing the interior of a building to achieve a healthier and more aesthetically pleasing environment for the people using the space, within Fashion, interior and industrial design. [cite: 70]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Stage designing",
    "description": "The creation of scenery, props, and overall visual environment for theatre, film, or television productions, a part of Fashion, interior and industrial design. [cite: 70]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Window dressing",
    "description": "The art of arranging goods in a shop window to attract customers, a specialized area of design under Fashion, interior and industrial design. [cite: 70]",
    "wiki": "",
    "resources": []
  }
]