[
  {
    "name": "Language acquisition",
    "description": "Within the Arts and Humanities / Languages domain, Language acquisition is the study of the structure and composition of languages when taught as second or foreign languages (i.e., for non-native speakers). It can include related culture, literature, linguistics, and phonetics if tied to the specific language being acquired. Classical languages are also included here. [cite: 99, 100, 101]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Classical languages",
    "description": "The study of ancient languages such as Latin or Classical Greek, treated as foreign languages for acquisition purposes within Language acquisition. [cite: 100, 102]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Exogenous languages",
    "description": "The study of foreign languages, i.e., languages not native to the speaker or the region, as part of Language acquisition. [cite: 102]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Foreign languages",
    "description": "The study and learning of languages other than one's native tongue, a core component of Language acquisition. [cite: 99, 102]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Interpretation",
    "description": "The skill and practice of orally translating speech from one language to another, studied within Language acquisition. [cite: 102, 103]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Phonetics",
    "description": "The study of speech sounds, their production, and perception, often included in Language acquisition programmes when related to a specific language being learned. [cite: 99, 102]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Second languages, for example English as a second language",
    "description": "The study of a language by non-native speakers in an environment where that language is spoken, a focus of Language acquisition. [cite: 99, 102]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sign language",
    "description": "The study and acquisition of languages that use manual communication and body language to convey meaning, included in Language acquisition. [cite: 102]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sign language interpreting",
    "description": "The skill of facilitating communication between users of spoken language and users of sign language, studied within Language acquisition. [cite: 102]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Translation",
    "description": "The process of rendering written text from one language into another, a skill developed in Language acquisition programmes. [cite: 102, 103]",
    "wiki": "",
    "resources": []
  }
]