[
  {
    "name": "Finance, banking and insurance",
    "description": "Within Business and administration, this field is the study of planning, directing, organizing, and controlling financial activities and services, including the management of financial resources and the provision of financial services at corporate and individual levels. [cite: 140, 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Bank teller studies",
    "description": "Training for individuals who work as bank tellers, handling customer transactions in a bank, a part of Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Banking and finance",
    "description": "Covers the operations of banks and financial institutions, and the principles of financial management, a core area of Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Finance theory",
    "description": "The study of the theoretical principles underlying financial decision-making and markets, within Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Insurance",
    "description": "The study of risk management and the business of providing financial protection against potential losses, a component of Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Investment analysis",
    "description": "The study of evaluating investments to determine their suitability for an investor, a key skill in Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Investments and securities",
    "description": "Focuses on the study of various investment instruments and the markets where they are traded, within Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Pension insurance",
    "description": "The study of insurance products designed to provide income during retirement, a part of Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Social insurance",
    "description": "The study of government-sponsored programmes providing financial protection against various social risks, such as unemployment or disability, related to Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Stock-broking",
    "description": "The business of buying and selling stocks and other securities on behalf of clients, studied within Finance, banking and insurance. [cite: 141]",
    "wiki": "",
    "resources": []
  }
]