[
  {
    "name": "Marketing and advertising",
    "description": "Within Business and administration, this field is the study of promoting the exchange of goods and services between organizations and individuals, including consumer behaviour, product development, pricing, distribution, promotion, and sales to maximize business performance. [cite: 149, 150]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Advertising",
    "description": "The practice of creating and disseminating paid messages to promote products, services, or ideas, a key component of Marketing and advertising. [cite: 150]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Consumer behaviour",
    "description": "The study of how individuals, groups, or organizations select, buy, use, and dispose of goods, services, ideas, or experiences to satisfy their needs and wants, crucial for Marketing and advertising. [cite: 149, 150]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Market research",
    "description": "The process of gathering, analyzing, and interpreting information about a market, about a product or service to be offered for sale in that market, and about the past, present, and potential customers for the product or service, fundamental to Marketing and advertising. [cite: 150]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Marketing",
    "description": "The activity, set of institutions, and processes for creating, communicating, delivering, and exchanging offerings that have value for customers, clients, partners, and society at large, the core of Marketing and advertising. [cite: 150]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Merchandising",
    "description": "The promotion of goods and/or services that are available for retail sale, including determining quantities, setting prices for goods and services, creating display designs, developing marketing strategies, and establishing discounts or coupons, within Marketing and advertising. [cite: 150]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Public relations",
    "description": "The practice of managing the spread of information between an individual or an organization and the public, often to build and maintain a positive image, a field within Marketing and advertising. [cite: 150]",
    "wiki": "",
    "resources": []
  }
]