[
  {
    "name": "Secretarial and office work",
    "description": "Under Business and administration, this field is the study of administrative procedures, office technology, and clerical skills such as shorthand and keyboarding. It includes specialised secretarial programmes if the main objective is secretarial work. [cite: 151, 152, 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Administrative and secretarial services",
    "description": "Covers a range of tasks supporting business operations, including general office duties and assistance to executives, a core part of Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Clerical programmes",
    "description": "Training in routine office tasks such as record keeping, filing, and correspondence, within Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Data entry",
    "description": "The process of inputting data into a computer system, a common skill in Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Foreign language secretary programmes",
    "description": "Specialized secretarial training that includes proficiency in one or more foreign languages for international business communication, as part of Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Keyboard skills",
    "description": "The ability to type efficiently and accurately using a keyboard, a fundamental skill in Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Legal secretary programmes",
    "description": "Specialized secretarial training focused on supporting legal professionals, including knowledge of legal terminology and procedures, within Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Medical secretary programmes",
    "description": "Specialized secretarial training for healthcare settings, involving medical terminology, patient records, and appointment scheduling, part of Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Operation of office equipment",
    "description": "Skills in using various office machines such as photocopiers, printers, and scanners, taught in Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Receptionist training",
    "description": "Programmes preparing individuals to manage front desk operations, including greeting visitors, answering phones, and providing information, within Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Secretarial programmes",
    "description": "General training in the duties and skills required of a secretary, forming the core of Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Shorthand",
    "description": "A system of rapid writing using symbols or abbreviations for letters, words, or phrases, a traditional skill in Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Switchboard operating",
    "description": "The skill of managing a telephone switchboard to connect calls, often part of receptionist duties in Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Typing",
    "description": "The skill of writing by means of a typewriter or computer keyboard, a fundamental component of Secretarial and office work. [cite: 153]",
    "wiki": "",
    "resources": []
  }
]