[
  {
    "name": "Electricity and energy",
    "description": "Within Engineering and engineering trades, this field covers the study of installing, maintaining, repairing, and diagnosing faults in electrical wiring and related equipment in various settings, as well as the study of energy generation, including electrical power and other energy sources.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Air-conditioning trades",
    "description": "The study and practice of installing, maintaining, and repairing air-conditioning systems, a specialized trade within Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Climate engineering",
    "description": "Focuses on engineering solutions related to controlling climate, including heating, ventilation, and air conditioning systems, as part of Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Electrical appliances repairing",
    "description": "The skills and knowledge required to repair various electrical appliances, a trade within Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Electrical engineering",
    "description": "A broad field within Electricity and energy dealing with the study and application of electricity, electronics, and electromagnetism.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Electrical fitting",
    "description": "The trade involving the installation and maintenance of electrical wiring and fixtures, a key part of Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Electrical power generation",
    "description": "The study of processes and technologies used to produce electrical power from various sources, a component of Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Electrical trades",
    "description": "Encompasses various skilled professions related to electrical systems installation, maintenance, and repair, within Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Energy studies",
    "description": "The interdisciplinary study of energy production, consumption, and policy, including various forms of energy, as part of Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Gas distribution",
    "description": "The study and management of systems for distributing gas as an energy source, included in Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Heating trades",
    "description": "Skills and knowledge related to the installation, maintenance, and repair of heating systems, a trade within Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Nuclear, hydraulic and thermal energy",
    "description": "The study of energy generation from nuclear, hydraulic (water), and thermal (heat) sources, a specialized area within Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Power line installation and maintenance",
    "description": "The trade focused on installing and maintaining overhead and underground electrical power distribution networks, part of Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Power production",
    "description": "The generation of power, particularly electrical power, from various sources, a core topic in Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Refrigeration",
    "description": "The study and practice of installing, maintaining, and repairing refrigeration systems, a trade within Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Solar power",
    "description": "The study and application of technologies to convert sunlight into electricity or thermal energy, a renewable energy focus within Electricity and energy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Wind turbines",
    "description": "The study, design, installation, and maintenance of wind turbines for generating electricity, part of renewable energy studies within Electricity and energy.",
    "wiki": "",
    "resources": []
  }
]