[
  {
    "name": "Mechanics and metal trades",
    "description": "This field in Engineering and engineering trades covers the study of planning, designing, developing, producing, maintaining, and monitoring machines, mechanical plants, systems, and metal products, with a focus on these items.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Gunsmithing",
    "description": "The craft of designing, building, modifying, repairing, and servicing firearms, a specialized metal trade within Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Hydraulics",
    "description": "The study of mechanical properties of liquids and the application of these properties in engineering, relevant to Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Locksmithing and safe repairing",
    "description": "The trade of designing, making, installing, and repairing locks and safes, a skilled area in Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Mechanical engineering",
    "description": "A broad engineering discipline that involves the design, production, and operation of machinery and mechanical systems, central to Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Mechanical trades",
    "description": "Encompasses various skilled professions related to the installation, maintenance, and repair of machinery and mechanical systems, within Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Metal casting and patternmaking",
    "description": "The processes of creating objects by pouring molten metal into molds (casting) and creating the patterns used to make these molds, key skills in Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Metal fitting, turning and machining",
    "description": "Trades involving the shaping of metal parts through fitting, operating lathes (turning), and using various machine tools, fundamental to Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Metallurgical engineering",
    "description": "The branch of engineering concerned with the physical and chemical behavior of metallic elements, their inter-metallic compounds, and their mixtures, which are called alloys, relevant to Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Precision mechanics",
    "description": "The design and manufacturing of small, highly accurate mechanical components and systems, a specialized area within Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sheet metal working",
    "description": "The trade of forming, cutting, and joining sheet metal to create various products, a skill in Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Steel production",
    "description": "The processes involved in manufacturing steel from raw materials, relevant to metallurgical aspects of Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Tool and die making",
    "description": "A skilled trade involving the creation and maintenance of tools, dies, jigs, and fixtures used in manufacturing processes, part of Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Welding",
    "description": "A fabrication process that joins materials, usually metals or thermoplastics, by using high heat to melt the parts together and allowing them to cool, causing fusion, a critical skill in Mechanics and metal trades.",
    "wiki": "",
    "resources": []
  }
]