[
  {
    "name": "Motor vehicles, ships and aircraft",
    "description": "A field in Engineering and engineering trades focused on designing, developing, producing, maintaining, diagnosing faults in, repairing, and servicing motor vehicles (including earth-moving equipment and agricultural machines), ships, trains, and aircraft. It typically combines studies in metal structures and motors.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Aerospace engineering",
    "description": "The primary field of engineering concerned with the development of aircraft and spacecraft, a major component of Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Aircraft engineering",
    "description": "Focuses on the design, construction, and testing of aircraft, a specialization within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Aircraft maintenance",
    "description": "The performance of tasks required to ensure the continuing airworthiness of an aircraft or aircraft part, including overhaul, repair, inspection, replacement, modification or defect rectification, a key area in Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Automotive electrical systems",
    "description": "The study and repair of electrical systems in motor vehicles, included within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Automotive engineering",
    "description": "A branch of vehicle engineering, incorporating elements of mechanical, electrical, electronic, software, and safety engineering as applied to the design, manufacture and operation of motorcycles, automobiles, and trucks and their respective engineering subsystems, central to Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Avionics",
    "description": "The electronic systems used on aircraft, artificial satellites, and spacecraft, a specialized field within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Coachwork",
    "description": "The design and construction of the bodies of motor vehicles, a trade within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Marine engineering",
    "description": "The engineering of boats, ships, submarines, and any other marine vessel or structure, as well as oceanographic engineering or nautical engineering, part of Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Motorcycle engineering",
    "description": "The design, development, and manufacturing of motorcycles and their components, a specialization within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Panel beating",
    "description": "The trade of repairing the bodies of motor vehicles after accidents, often involving shaping and smoothing metal panels, within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Shipbuilding",
    "description": "The construction of ships and other floating vessels, a major industry within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Train repair and maintenance",
    "description": "The skills and processes involved in keeping railway locomotives and rolling stock in operational condition, part of Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Vehicle building and repairing",
    "description": "General study of the construction and repair of various types of vehicles, a core aspect of Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Vehicle varnishing/spraying",
    "description": "The trade of applying paint and protective coatings to vehicles, often as part of repair or manufacturing, within Motor vehicles, ships and aircraft.",
    "wiki": "",
    "resources": []
  }
]