[
  {
    "name": "Architecture and town planning",
    "description": "Under Engineering, Manufacturing and Construction / Architecture and construction, Architecture is the art, science, and technique of building design, balancing utilitarian, functional, economic, and aesthetic considerations. Town planning is the study of regulated growth and improvement of towns from functional and aesthetic viewpoints.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Architectural urban design and planning",
    "description": "Focuses on the design and planning of urban areas at various scales, integrating architectural principles with urban development strategies, within Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Architecture",
    "description": "The art and science of designing and constructing buildings and other physical structures, a core discipline in Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Building design",
    "description": "The process of creating designs for new buildings, encompassing aesthetic, functional, and structural aspects, a key part of Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Cartography/Land surveying",
    "description": "Cartography is the study and practice of making maps, while land surveying is the technique, profession, and science of determining the terrestrial or three-dimensional positions of points and the distances and angles between them, relevant to Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "City planning",
    "description": "The process of designing and managing the physical development of cities and urban areas, a major component of Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Community development",
    "description": "A process where community members come together to take collective action and generate solutions to common problems, often involving physical planning aspects studied in Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Landscape architecture",
    "description": "The design of outdoor areas, landmarks, and structures to achieve environmental, social-behavioral, or aesthetic outcomes, a specialization within Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Structural architecture",
    "description": "Focuses on the structural integrity and engineering aspects of building design, ensuring stability and safety, within Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Surveying",
    "description": "The science and art of making all essential measurements to determine the relative position of points or physical and cultural details above, on, or beneath the surface of the Earth, and to depict them in a usable form, often supporting Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Town and country planning",
    "description": "The planning and control of the construction, growth, and development of a town or other urban area, as well as rural areas, a comprehensive field within Architecture and town planning.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Urban planning",
    "description": "A technical and political process concerned with the development and design of land use and the built environment, including air, water, and the infrastructure passing into and out of urban areas, such as transportation, communications, and distribution networks, central to Architecture and town planning.",
    "wiki": "",
    "resources": []
  }
]