[
  {
    "name": "Social work and counselling",
    "description": "Within Welfare, this field is the study of the welfare needs of communities, specific groups, and individuals, and the appropriate ways of meeting these needs. The focus is on social welfare, policy, and practice.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Alcohol and drug abuse counselling",
    "description": "Providing therapeutic support and guidance to individuals struggling with alcohol or drug addiction, a specialization within Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Alcohol, tobacco, drugs (knowledge about)",
    "description": "Study of the effects, risks, and societal impacts of alcohol, tobacco, and drug use, relevant for Social work and counselling professionals.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Crisis support",
    "description": "Providing immediate assistance and counselling to individuals experiencing acute emotional distress or crisis situations, a key skill in Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Family and marriage counselling",
    "description": "Therapeutic services aimed at helping families and couples resolve conflicts, improve communication, and strengthen relationships, a part of Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Mobbing and maltreatment (knowledge about)",
    "description": "Understanding the dynamics, effects, and interventions related to workplace mobbing (bullying) and other forms of maltreatment, relevant for Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Parole officer training",
    "description": "Training for professionals who supervise offenders released from prison on parole, ensuring compliance with conditions and supporting reintegration, related to Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Probation officer training",
    "description": "Training for officers who supervise offenders serving probation sentences in the community, monitoring compliance and providing support, related to Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Social policy",
    "description": "The study of societal responses to social needs and problems, including the development, implementation, and evaluation of social programs and policies, a core area of Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Social practice",
    "description": "The application of social work theories and methods in direct service to individuals, families, groups, and communities, a key aspect of Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Social theory (applied)",
    "description": "The application of sociological and social psychological theories to understand and address social issues in practical settings, relevant to Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Social work (welfare)",
    "description": "A profession concerned with helping individuals, families, groups and communities to enhance their individual and collective well-being, the central discipline in Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Vocational counselling",
    "description": "Providing guidance and support to individuals in making career choices, developing job skills, and navigating the world of work, a specialization within Social work and counselling.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Vocational guidance",
    "description": "Assisting individuals in choosing and pursuing appropriate careers based on their interests, abilities, and job market opportunities, closely related to vocational counselling within Social work and counselling.",
    "wiki": "",
    "resources": []
  }
]