[
  {
    "name": "Personal skills",
    "description": "Within Generic Programmes and Qualifications, Personal skills development refers to programmes focusing on enhancing an individual's mental, social, and other capacities through key competencies and transferable skills, not covered elsewhere in basic education or literacy/numeracy. [cite: 42]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Argumentation and presentation",
    "description": "A component of Personal skills development, focusing on developing abilities in constructing arguments and delivering presentations. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Assertiveness training",
    "description": "A Personal skills programme aimed at developing self-confidence and the ability to express oneself clearly and respectfully. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Communication skills",
    "description": "Programmes under Personal skills development designed to improve interpersonal and general communication abilities. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Co-operation",
    "description": "Focuses on developing the ability to work effectively with others, as part of Personal skills development. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Development of behavioural capacities",
    "description": "Personal skills programmes aimed at enhancing various behavioural aspects of an individual. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Development of mental skills",
    "description": "Personal skills programmes targeting the improvement of cognitive and mental abilities. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Job-seeking programmes",
    "description": "These are Personal skills programmes that equip individuals with skills and strategies for finding employment. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Parenting courses",
    "description": "Courses under Personal skills development that provide guidance and skills for effective parenting. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Public speaking",
    "description": "A Personal skills programme focused on developing the ability to speak effectively in public. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Self-esteem skills",
    "description": "Programmes within Personal skills development aimed at building and enhancing self-esteem. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Social competence",
    "description": "Focuses on developing skills for effective social interaction, as part of Personal skills development. [cite: 43]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Time management",
    "description": "A Personal skills programme teaching techniques for organizing and using time effectively. [cite: 43]",
    "wiki": "",
    "resources": []
  }
]