[
  {
    "name": "Fine arts",
    "description": "Belonging to the Arts, Fine arts is the study of visual forms of creative expression, encompassing theory, history, techniques, performance, and production in areas such as painting and sculpture. [cite: 73, 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Art theory",
    "description": "The study of the philosophical and theoretical underpinnings of art, a component of Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Calligraphy",
    "description": "The art of beautiful handwriting, considered a visual art form within Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Etching",
    "description": "A printmaking technique using acid to incise a design into a metal plate, studied as part of Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Fine art printmaking",
    "description": "The creation of artworks by printing, normally on paper, but also on other surfaces, a discipline within Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of art",
    "description": "The academic study of the history and development of the visual arts, an integral part of Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Painting",
    "description": "The practice of applying paint, pigment, color or other medium to a solid surface, a primary discipline in Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Philosophy of art",
    "description": "A branch of philosophy that explores the nature of art, including concepts such as interpretation, representation, expression, and form, studied within Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sculpture",
    "description": "The art of making two- or three-dimensional representative or abstract forms, especially by carving stone or wood or by casting metal or plaster, a key area of Fine arts. [cite: 74]",
    "wiki": "",
    "resources": []
  }
]