[
  {
    "name": "Handicrafts",
    "description": "Within the Arts, Handicrafts is the study of techniques and skills in creating decorative or functional objects by hand or with simple tools, covering crafts like jewellery, pottery, weaving, and woodcarving. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Ceramics",
    "description": "The art and techniques of making objects from clay and firing them at high temperatures, a traditional handicraft. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Crafts, folk arts and artisan",
    "description": "Encompasses a broad range of traditional and contemporary handmade objects, reflecting cultural heritage and skilled artisanship, as studied in Handicrafts. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Decorative metal crafts",
    "description": "The creation of decorative objects from metal using various handicraft techniques. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Indigenous crafts",
    "description": "Traditional crafts and artistic practices of indigenous peoples, studied as part of Handicrafts. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Embroidery",
    "description": "The handicraft of decorating fabric or other materials using a needle to apply thread or yarn. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Floristry (flower arranging)",
    "description": "The art and craft of arranging flowers and plant materials for decorative purposes, considered a handicraft. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Glass arts and craft",
    "description": "The creation of artistic or functional objects from glass using handicraft techniques like blowing or fusing. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Goldsmithing",
    "description": "The handicraft of working with gold and other precious metals to create jewellery and other objects. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Jewellery",
    "description": "The design and creation of personal ornaments, such as necklaces, rings, or bracelets, typically made from or containing jewels and precious metal, as a handicraft. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Making of musical instruments (not industrial)",
    "description": "The handicraft of constructing musical instruments by hand or with simple tools, distinct from large-scale industrial production. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Musical instruments (repairing and tuning)",
    "description": "The skilled craft of repairing and tuning musical instruments, often by hand, as part of Handicrafts. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Silversmithing",
    "description": "The handicraft of making objects from silver. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Stone carving (craft)",
    "description": "The handicraft of shaping stone to create artistic or functional forms. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Weaving (craft)",
    "description": "The handicraft of forming fabric by interlacing threads or yarns, distinct from industrial weaving. [cite: 78]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Woodcarving",
    "description": "The handicraft of shaping wood by cutting with a knife or other sharp tool to create figures or designs. [cite: 78]",
    "wiki": "",
    "resources": []
  }
]