[
  {
    "name": "Music and performing arts",
    "description": "Under the Arts, this field is the study of principles and techniques associated with performance involving music, speech, movement, mime, characterisation, improvisation, and stagecraft. It includes the study of music and performing arts history and theory. [cite: 79, 80, 81]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Acting and directing",
    "description": "The study and practice of performing roles in plays, films, etc., and the art of guiding and instructing actors in a performance, within Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Ballet",
    "description": "A classical dance form demanding grace and precision and employing formalized steps and gestures set in intricate, flowing patterns, studied in Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Choreography",
    "description": "The art or practice of designing sequences of movements of physical bodies (or their depictions) in which motion, form, or both are specified, a key part of Music and performing arts, especially dance. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Circus",
    "description": "A form of performing arts involving a variety of skilled acts such as acrobatics, clowning, and animal training. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Composition (music)",
    "description": "The art and technique of creating original pieces of music, a discipline within Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Conducting (music)",
    "description": "The art of directing a musical performance, such as by an orchestra or choir, by way of visible gestures, studied in Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Creative and performance art",
    "description": "Encompasses various artistic expressions that are performed live or created with a focus on the act of creation itself, a broad category within Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dance",
    "description": "The art of movement of the body, usually rhythmically and to music, using prescribed or improvised steps and gestures, a major component of Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Drama",
    "description": "The study and practice of theatrical performance, including acting, directing, and playwriting, within Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of film and theatre",
    "description": "The academic study of the historical development of film and theatrical performances, part of Music and performing arts. [cite: 80, 81]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of music",
    "description": "The scholarly study of the historical development of music, including its styles, composers, and cultural contexts, within Music and performing arts. [cite: 80, 81]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Music",
    "description": "The art of sound in time that expresses ideas and emotions in significant forms through the elements of rhythm, melody, harmony, and color, a central focus of Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Music conducting",
    "description": "Synonymous with 'Conducting (music)', referring to the direction of musical ensembles, within Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Musicology",
    "description": "The scholarly study of music, including its history, theory, and cultural aspects, a discipline within Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Theatre/Theatre sciences",
    "description": "The study of all aspects of theatre, including performance, production, history, and theory, as part of Music and performing arts. [cite: 80]",
    "wiki": "",
    "resources": []
  }
]