[
  {
    "name": "History and archaeology",
    "description": "Under Humanities (except languages), History is the study of past events, particularly the political, social, and economic development of societies, while Archaeology is the study of ancient civilizations through material remains. This field also includes the history of medicine, science, and ideas. [cite: 88, 89, 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Archaeology",
    "description": "The study of human history and prehistory through the excavation of sites and the analysis of artefacts and other physical remains, a key component of History and archaeology. [cite: 89, 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Cultural history",
    "description": "The study of the cultural practices, beliefs, and expressions of past societies, within the broader field of History and archaeology. [cite: 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Folklore studies",
    "description": "The study of traditional beliefs, customs, and stories of a community, passed through the generations by word of mouth, as part of History and archaeology. [cite: 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History",
    "description": "The study of past events, societies, and their development, a central discipline in History and archaeology. [cite: 88, 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of literature",
    "description": "The historical study of literary works and their development over time, classified under History and archaeology when not combined with the study of a specific language. [cite: 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of medicine",
    "description": "The study of the historical development of medical knowledge, practices, and institutions, included in History and archaeology. [cite: 88, 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of science and ideas",
    "description": "The study of the historical development of scientific thought, theories, and broader intellectual concepts, part of History and archaeology. [cite: 88, 90]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of technology",
    "description": "The study of the historical development of technology and its impact on society, within History and archaeology. [cite: 90]",
    "wiki": "",
    "resources": []
  }
]