[
  {
    "name": "Literature and linguistics",
    "description": "Within Arts and Humanities / Languages, Literature and linguistics is the study of language(s) intended for native, fluent, or competent speakers. It includes the study of related literature and linguistics, and may cover the structure and composition of the language. [cite: 105, 106]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Creative writing",
    "description": "The practice of writing imaginative texts, such as fiction, poetry, or drama, often studied in one's native language within Literature and linguistics. [cite: 106]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "First language",
    "description": "The study of one's native language, its literature, and linguistics, a core component of Literature and linguistics. [cite: 106, 107]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Indigenous languages",
    "description": "The study of languages native to a particular region or spoken by indigenous peoples, typically for fluent or competent speakers, within Literature and linguistics. [cite: 106]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Linguistics",
    "description": "The scientific study of language and its structure, including aspects like phonology, morphology, syntax, semantics, and pragmatics, especially when not tied to acquiring a specific foreign language, falling under Literature and linguistics. [cite: 106, 109]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Literature",
    "description": "The study of written works, especially those considered of superior or lasting artistic merit, often in one's native language or in a comparative context, a key part of Literature and linguistics. [cite: 106, 109]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "\"Mother tongue\" languages",
    "description": "Synonymous with 'First language', referring to the study of one's native language and its literature, within Literature and linguistics. [cite: 106, 107]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Native first languages",
    "description": "The study of languages that are the first languages of the speakers, including their structure, literature, and linguistics, as part of Literature and linguistics. [cite: 106]",
    "wiki": "",
    "resources": []
  }
]