[
  {
    "name": "Political sciences and civics",
    "description": "Under Social and behavioural sciences, this field is the study of government, political principles, political behaviour, and political systems, as well as the rights and duties of citizens. [cite: 119, 120]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Civics",
    "description": "The study of the rights and obligations of citizens in society, a core component of Political sciences and civics. [cite: 120]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Human rights",
    "description": "The study of basic rights and freedoms to which all humans are considered to be entitled, often examined within Political sciences and civics. [cite: 120]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "International relations",
    "description": "The study of relationships between countries, including the roles of states, inter-governmental organizations (IGOs), international non-governmental organizations (INGOs), and multinational corporations (MNCs), a major area of Political sciences and civics. [cite: 120]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Peace and conflict studies",
    "description": "An interdisciplinary field that analyzes violent and nonviolent behaviours as well as the structural mechanisms attending conflicts, with a view towards understanding those processes which lead to a more desirable human condition, studied within Political sciences and civics. [cite: 120]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Political history",
    "description": "The study of past political events, ideas, movements, leaders, and institutions, a branch of Political sciences and civics. [cite: 120]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Political science",
    "description": "The systematic study of governance by the application of empirical and generally scientific methods of analysis, the central discipline in Political sciences and civics. [cite: 120]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Public policy studies",
    "description": "The study of how governments and public authorities develop, implement, and evaluate policies to address societal problems, an area of Political sciences and civics. [cite: 120]",
    "wiki": "",
    "resources": []
  }
]