[
  {
    "name": "Sociology and cultural studies",
    "description": "Within Social and behavioural sciences, Sociology is the study of human social relationships and institutions, while Cultural Studies explores the dynamic, diverse, and contested processes through which cultures are produced, performed, and transformed. This field includes ethnology, social anthropology, and human/social geography. [cite: 123, 124, 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Criminology",
    "description": "The scientific study of crime as a social phenomenon, of criminals, and of penal treatment, often considered a subfield of Sociology. [cite: 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Cultural geography",
    "description": "A sub-field of geography that studies the cultural products and norms and their variations across spaces and places, part of Sociology and cultural studies. [cite: 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Cultural studies",
    "description": "An interdisciplinary field that examines the political dynamics of contemporary culture, as well as its historical foundations, defining features, conflicts, and contingencies. [cite: 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Demography/population studies",
    "description": "The statistical study of populations, especially human beings, including their size, structure, and distribution, and how these change over time, an area within Sociology and cultural studies. [cite: 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Ethnology",
    "description": "A branch of anthropology that analyzes and compares the characteristics of different peoples and the relationships between them, included in Sociology and cultural studies. [cite: 124, 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Gender studies",
    "description": "An interdisciplinary academic field devoted to analysing gender identity and gendered representation as central categories of analysis, part of Sociology and cultural studies. [cite: 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Social anthropology",
    "description": "The study of human societies and cultures and their development, closely related to ethnology and sociology, within Sociology and cultural studies. [cite: 124, 125]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sociology",
    "description": "The systematic study of society, social relationships, social interaction, and culture, the core discipline in Sociology and cultural studies. [cite: 125]",
    "wiki": "",
    "resources": []
  }
]