[
  {
    "name": "Journalism and reporting",
    "description": "Under Social Sciences, Journalism and Information, this is the study of the theory and practices of gathering, processing, and disseminating news and information to the public, focusing on the wording and content of messages. [cite: 128, 129]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Broadcast journalism",
    "description": "Journalism that is disseminated through electronic media, such as radio and television, a specialization within Journalism and reporting. [cite: 129]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Editing",
    "description": "The process of selecting, preparing, and revising written, visual, audible, or cinematic material used by a person or an entity to convey a message or information, a key skill in Journalism and reporting. [cite: 129]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Information (wording and content)",
    "description": "Focuses on the construction and meaning of messages in communication, central to Journalism and reporting. [cite: 129]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Journalism",
    "description": "The activity or profession of writing for newspapers, magazines, or news websites or preparing news to be broadcast, the core of Journalism and reporting. [cite: 128, 129]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Mass communication (wording and content)",
    "description": "The study of how individuals and entities relay information through mass media to large segments of the population at the same time, focusing on message content and wording, within Journalism and reporting. [cite: 129]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "News reporting",
    "description": "The practice of gathering and presenting information about current events for publication or broadcast, a fundamental aspect of Journalism and reporting. [cite: 129]",
    "wiki": "",
    "resources": []
  }
]