[
  {
    "name": "Library, information and archival studies",
    "description": "Within Social Sciences, Journalism and Information, this field is the study of methods for selecting, acquiring, organizing, preserving, and facilitating the use of collections of information in libraries, archives, and museums. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Archival sciences",
    "description": "The study and theory of building and curating archives, which are collections of historical documents or records, a part of Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Curatorial studies",
    "description": "The study of the theory and practice of curating, which involves assembling, managing, and presenting collections of art or artifacts in museums or galleries, related to Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Documentation",
    "description": "The process of collecting, organizing, storing, and disseminating information, particularly in specialized fields, within Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Information science",
    "description": "An interdisciplinary field primarily concerned with the analysis, collection, classification, manipulation, storage, retrieval, movement, dissemination, and protection of information, a core component of Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Library studies",
    "description": "The study of the organization, management, and services of libraries, a central part of Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Museum documentation",
    "description": "The processes involved in creating and managing records about museum collections, an area within Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Museum studies",
    "description": "The interdisciplinary study of museums, their history, functions, and role in society, included in Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Museology",
    "description": "The science or practice of organizing, arranging, and managing museums, a key aspect of Museum studies within Library, information and archival studies. [cite: 134]",
    "wiki": "",
    "resources": []
  }
]