[
  {
    "name": "Management and administration",
    "description": "Under Business and administration, this is the study of planning, directing, and operating the functions and activities of organizations and institutions. Programmes emphasize management and administration, and may include aspects of economics and finance. [cite: 143, 144]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Administration",
    "description": "The process or activity of running a business, organization, etc., a core component of Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Educational management",
    "description": "The study of management principles as applied to educational institutions, a specialization within Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Employment management",
    "description": "Focuses on the management of human resources within an organization, including recruitment, training, and employee relations, part of Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Entrepreneurship",
    "description": "The study of designing, launching and running a new business, which is often initially a small business, a key area of Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Health administration",
    "description": "The management of healthcare facilities and systems, a specialization within Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Logistic management",
    "description": "The part of supply chain management that plans, implements, and controls the efficient, effective forward and reverse flow and storage of goods, services, and related information between the point of origin and the point of consumption, studied in Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Management science",
    "description": "The broad interdisciplinary study of problem solving and decision making in human organizations, with strong links to management, economics, business, engineering, management consulting, and other fields, within Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Office management",
    "description": "The administration and supervision of work in an office environment, ensuring efficiency and productivity, a part of Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Organizational theory and behaviour",
    "description": "The study of how individuals and groups act within organizations, and how organizations function, a key aspect of Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Personnel administration",
    "description": "The administrative aspects of managing an organization's workforce, such as record-keeping and compliance, within Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Personnel management",
    "description": "Focuses on recruiting, selecting, training, and developing employees, also known as human resource management, a core area of Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "'Start your own business' courses",
    "description": "Practical courses aimed at equipping individuals with the knowledge and skills to start and manage their own business, related to Entrepreneurship within Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Supply change management",
    "description": "Likely a typo for 'Supply Chain Management', which is the management of the flow of goods and services, involving the movement and storage of raw materials, work-in-process inventory, and finished goods from point of origin to point of consumption, studied in Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Training management",
    "description": "The planning, organization, and implementation of training programs within an organization, a part of Management and administration. [cite: 145]",
    "wiki": "",
    "resources": []
  }
]