[
  {
    "name": "Wholesale and retail sales",
    "description": "Within Business and administration, this field is the study of buying and selling goods and services, covering stock management, pricing, loss prevention, sales systems, and current industry trends. It includes the selling of buildings and properties. [cite: 155]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Auctioneering",
    "description": "The business of selling goods or property by means of auction, studied within Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Consumer services",
    "description": "Relates to services provided directly to consumers, often in a retail context, and is part of Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Demonstration techniques",
    "description": "Skills in effectively showcasing products to potential customers, important in Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Purchasing",
    "description": "The process of acquiring goods or services, often in a business context for resale or use, a key aspect of Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Real-estate business",
    "description": "The buying, selling, and management of properties, including land and buildings, a specialized area within Wholesale and retail sales. [cite: 156, 157]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Retailing",
    "description": "The sale of goods to ultimate consumers, usually in small quantities, the core of the retail part of Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Stock-keeping",
    "description": "The management of inventory, including ordering, storage, and tracking of goods, essential in Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Ware-housing",
    "description": "The storage of goods in a warehouse, often part of the logistics of Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Wholesaling",
    "description": "The sale of goods in large quantities, typically to retailers for resale, a major component of Wholesale and retail sales. [cite: 156]",
    "wiki": "",
    "resources": []
  }
]