[
  {
    "name": "Work skills",
    "description": "Under Business and administration, Work skills involves the study of the structure and function of working life, often through staff training programmes related to the workplace and specific job assignments. It is focused on work development rather than personal development. [cite: 158, 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Clients' needs",
    "description": "Understanding and addressing the requirements and expectations of clients, a key component of Work skills, particularly in customer service. [cite: 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Company knowledge",
    "description": "Familiarity with an organization's products, services, policies, and culture, important for effective performance, covered in Work skills training. [cite: 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Customer service training",
    "description": "Programmes designed to improve skills in interacting with and assisting customers, a common type of Work skills training. [cite: 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "'Introduction to work' courses",
    "description": "Orientation programmes for new employees or individuals entering the workforce, providing foundational Work skills and knowledge about the work environment. [cite: 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Organization at work",
    "description": "Understanding the structure, processes, and dynamics of the workplace, a topic within Work skills. [cite: 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Quality assurance",
    "description": "Processes and activities aimed at ensuring products or services meet specified quality standards, often part of Work skills training. [cite: 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Trade union courses (general)",
    "description": "General courses related to the role and function of trade unions, often considered as part of Work skills or industrial relations knowledge. [cite: 159]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Work development",
    "description": "Focuses on improving job-related skills and competencies to enhance performance and productivity within the workplace, the core of Work skills. [cite: 159]",
    "wiki": "",
    "resources": []
  }
]