[
  {
    "name": "Law",
    "description": "Within Business, Administration and Law, Law is the study of the principles and procedures for formally maintaining social order. This includes training for legal professions such as advocates or for judicial roles. [cite: 164, 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Commercial law",
    "description": "The body of law that applies to the rights, relations, and conduct of persons and businesses engaged in commerce, merchandising, trade, and sales, a specialization within Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Criminal justice studies",
    "description": "The study of the systems and processes involved in enforcing laws, adjudicating crimes, and correcting criminal conduct, closely related to Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "History of law",
    "description": "The study of the historical development of legal systems, principles, and institutions, a part of the academic study of Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Indigenous law",
    "description": "The study of the legal traditions, customs, and rules of indigenous peoples, a specialized area within Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Jurisprudence",
    "description": "The theory or philosophy of law, exploring the nature of law, legal reasoning, legal systems, and legal institutions, an advanced study within Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Labour law",
    "description": "The body of laws, administrative rulings, and precedents which address the legal rights of, and restrictions on, working people and their organizations, a field of Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Legal practice",
    "description": "The application of legal knowledge and skills in representing clients, advising on legal matters, and appearing in court, the professional aspect of Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Notary/Notary's practise",
    "description": "The study and functions of a notary public, who is authorized to perform certain legal formalities, especially to draw up or certify contracts, deeds, and other documents for use in other jurisdictions, related to Law. [cite: 165]",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Paralegal studies",
    "description": "Training for individuals who assist lawyers by performing various legal tasks, such as research, drafting documents, and case management, a supportive role within the field of Law. [cite: 165]",
    "wiki": "",
    "resources": []
  }
]