[
  {
    "name": "Environmental protection technology",
    "description": "Within Engineering and engineering trades, this field is the study of processes designed to minimize discharge and waste, avoid pollution, and control impacts on water, air, and soil.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Air pollution control",
    "description": "Technologies and strategies aimed at reducing or eliminating the emission of pollutants into the atmosphere.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Ecological technology",
    "description": "The application of ecological principles to the design and management of sustainable technologies and systems.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Energy efficiency",
    "description": "The study and application of methods to reduce energy consumption while maintaining or improving output, a key aspect of environmental protection technology.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Environmental engineering",
    "description": "The branch of engineering concerned with protecting people from adverse environmental effects and improving environmental quality.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Industrial discharge control",
    "description": "Technologies and methods for managing and treating waste discharged from industrial processes to minimize environmental impact.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Noise pollution control",
    "description": "Techniques and strategies for reducing unwanted or disturbing sound levels in the environment.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Recycling",
    "description": "The process of converting waste materials into new materials and objects, a core component of environmental protection technology.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Water pollution control",
    "description": "Technologies and strategies aimed at reducing or eliminating the contamination of water bodies.",
    "wiki": "",
    "resources": []
  }
]