[
  {
    "name": "Electronics and automation",
    "description": "A field within Engineering and engineering trades that involves the study of planning, designing, developing, maintaining, and monitoring electronic equipment, machinery, and systems, including computer hardware and communication equipment.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Broadcasting electronics",
    "description": "The study of electronic systems and equipment used in radio and television broadcasting, a specialization within Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Communication systems",
    "description": "The study and design of systems used for transmitting information, including telecommunications and data networks, as part of Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Communications equipment installation",
    "description": "The practical skills involved in installing various types of communication equipment, a trade within Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Communications equipment maintenance",
    "description": "The skills and knowledge required to maintain and repair communication equipment, a key area in Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Computer engineering",
    "description": "Focuses on the design, development, and testing of computer hardware and systems, a major component of Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Computer repairing",
    "description": "The trade of diagnosing and fixing problems with computer hardware, within Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Control engineering",
    "description": "The engineering discipline that applies control theory to design systems with desired behaviors in control environments, relevant to Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Data processing technology",
    "description": "The study of technologies and methods used to process and manage data electronically, part of Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Digital technology",
    "description": "The study of electronic tools, systems, devices and resources that generate, store or process data, a broad area within Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Electronic engineering",
    "description": "A discipline that utilizes non-linear and active electrical components to design electronic circuits, devices, integrated circuits and their systems, central to Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Electronic equipment servicing",
    "description": "The maintenance and repair of various electronic devices and equipment, a practical skill in Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Network technology",
    "description": "The study of designing, implementing, and managing computer networks, a key aspect of Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Robotics",
    "description": "An interdisciplinary branch of engineering and science that includes mechanical engineering, electronic engineering, information engineering, computer science, and others, focused on the design, construction, operation, and use of robots, part of Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Telecommunications technology",
    "description": "The study of technologies used for communication over a distance, including telephone, radio, television, and internet, within Electronics and automation.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Television and radio repairing",
    "description": "The trade of diagnosing and fixing problems with television and radio equipment, a specialized skill in Electronics and automation.",
    "wiki": "",
    "resources": []
  }
]