[
  {
    "name": "Textiles (clothes, footwear and leather)",
    "description": "A field in Manufacturing and processing that covers the manufacture of textiles, textile and leather products, clothing, shoes, and other footwear. It focuses on the industrial production aspects.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Clothing trades",
    "description": "Skilled professions involved in the design, cutting, sewing, and finishing of garments, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dressmaking",
    "description": "The craft of making dresses and other garments, often with a focus on custom fitting and design, part of Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Footwear making",
    "description": "The design and construction of shoes and other footwear, a specialized trade in Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Fur making",
    "description": "The trade of processing and crafting garments and accessories from animal furs, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Garment production",
    "description": "The industrial processes involved in manufacturing clothing on a large scale, a key aspect of Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Leather processing",
    "description": "The transformation of raw animal hides and skins into leather through tanning and other treatments, part of Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Saddlery",
    "description": "The craft of making saddles and other equipment for horses, typically from leather, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Shoemaking",
    "description": "Synonymous with 'Footwear making', referring to the craft and industry of producing shoes, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Skins and leather production",
    "description": "The processes involved in obtaining and preparing animal skins and transforming them into leather for various uses, part of Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Spinning",
    "description": "The process of twisting fibers together to create yarn or thread for textile production, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Tailoring",
    "description": "The art and trade of designing, cutting, fitting, and finishing clothes, especially suits and coats, often to individual measurements, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Textile trades",
    "description": "Encompasses various skilled professions related to the production and processing of textiles and textile products, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Upholstery",
    "description": "The craft of providing furniture, especially seats, with padding, springs, webbing, and fabric or leather covers, a trade within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Weaving (industrial)",
    "description": "The large-scale manufacturing of fabric by interlacing threads or yarns on looms, distinct from craft weaving, part of Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Wool science",
    "description": "The study of wool fibers, their properties, processing, and use in textile manufacturing, within Textiles (clothes, footwear and leather).",
    "wiki": "",
    "resources": []
  }
]