[
  {
    "name": "Building and civil engineering",
    "description": "Within Architecture and construction, Building is the study of the science, technology, and techniques of assembling, erecting, and maintaining various structures. Civil engineering is the study of planning, designing, testing, and directing the construction of large-scale buildings and infrastructure.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Bricklaying",
    "description": "The trade of laying bricks and other masonry units to construct walls, foundations, and other structures, a key skill in Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Bridge construction",
    "description": "The specialized area of civil engineering focused on the design and construction of bridges.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Building construction",
    "description": "The general process of adding structures to real property, a core activity in Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Building engineering",
    "description": "The application of engineering principles and technology to building design and construction, part of Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Building technology",
    "description": "The study of materials, methods, and systems used in building construction, within Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Carpentry and joinery (building)",
    "description": "Skilled trades involving cutting, shaping, and installing wood components in building construction, such as framing, roofing, and finishing, as part of Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Civil engineering",
    "description": "A professional engineering discipline that deals with the design, construction, and maintenance of the physical and naturally built environment, including public works such as roads, bridges, canals, dams, airports, sewerage systems, pipelines, structural components of buildings, and railways, central to Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Construction equipment",
    "description": "The study and operation of heavy machinery and equipment used in construction projects, relevant to Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Constructional metalwork (building)",
    "description": "The fabrication and erection of metal structures and components in building construction, a specialized trade in Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dock and harbour engineering",
    "description": "A branch of civil engineering focused on the design, construction, and maintenance of docks, harbours, and other coastal structures.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Floor and wall tiling",
    "description": "The trade of installing tiles on floors and walls, a finishing skill in Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Floor covering",
    "description": "The installation of various types of flooring materials, such as carpet, vinyl, or wood, within Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "House building",
    "description": "The specific process of constructing residential houses, a segment of Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Industrial abseiling (commercial)",
    "description": "The use of rope access techniques for construction, maintenance, and inspection work on high or difficult-to-reach structures, a specialized skill in Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Masonry and tile setting",
    "description": "Trades involving the construction with stone, brick, or concrete blocks (masonry) and the installation of tiles, key skills in Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Painting and wall covering",
    "description": "The trades of applying paint, wallpaper, and other finishes to interior and exterior surfaces in building construction, part of Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Plastering",
    "description": "The trade of applying plaster or stucco to walls and ceilings to create smooth or textured surfaces, a finishing skill in Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Plumbing and pipefitting",
    "description": "Trades involving the installation and maintenance of water supply, drainage, and gas systems in buildings, essential to Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Road building",
    "description": "The design, construction, and maintenance of roads and highways, a major area of Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Water engineering and technology",
    "description": "Focuses on the engineering and technological aspects of water supply, treatment, and management systems, a specialized field within Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Water supply and sewerage engineering",
    "description": "The design and construction of systems for providing clean water and managing wastewater, a critical part of Building and civil engineering.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Ventilation",
    "description": "The design and installation of systems for providing fresh air and controlling air quality in buildings, within Building and civil engineering.",
    "wiki": "",
    "resources": []
  }
]