[
  {
    "name": "Crop and livestock production",
    "description": "Within Agriculture, this field involves the study of growing, maintaining, and harvesting crops and pastures, as well as grazing and managing animals. It includes farm management and the production of unprocessed plant and animal products, along with soil fertility and irrigation techniques.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Agricultural sciences",
    "description": "The broad scientific study of agriculture, including aspects of crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Agronomy and crop science",
    "description": "The science and technology of producing and using plants for food, fuel, fiber, and land reclamation, a key part of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Animal husbandry",
    "description": "The branch of agriculture concerned with the care, breeding, and management of livestock, central to Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Crop growing",
    "description": "The cultivation of plants for food, feed, fiber, or other uses, a fundamental aspect of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dog breeding",
    "description": "The practice of mating selected dogs with the intent to maintain or produce specific qualities and characteristics, a specialized area within animal management under Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Farm and ranch management",
    "description": "The organization and operation of farms and ranches for profit, including decision-making on crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Farming",
    "description": "The general activity of growing crops and raising livestock, the core of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Fruit growing",
    "description": "The cultivation of fruit crops, a specialization within Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Grain growing",
    "description": "The cultivation of cereal grains like wheat, rice, and corn, a major component of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Horse breeding",
    "description": "The practice of mating selected horses to produce offspring with desired traits, part of animal management in Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Pig farming",
    "description": "The raising of pigs for meat production, a segment of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Poultry husbandry",
    "description": "The raising of domesticated birds such as chickens, turkeys, ducks, and geese for meat or eggs, part of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Rice farming",
    "description": "The cultivation of rice, a staple grain crop, within Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Rye and wheat growing",
    "description": "The cultivation of rye and wheat, important cereal crops, as part of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sheep farming",
    "description": "The raising of sheep for wool, meat, or milk, a sector of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Soil science",
    "description": "The study of soil as a natural resource on the surface of the Earth including soil formation, classification and mapping; physical, chemical, biological, and fertility properties of soils; and these properties in relation to the use and management of soils, crucial for Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Sugar cane growing",
    "description": "The cultivation of sugar cane for sugar production, a specialized crop in Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Vegetable planting",
    "description": "The cultivation of vegetable crops, a significant part of Crop and livestock production.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Wine growing",
    "description": "Also known as viticulture, this is the cultivation and harvesting of grapes, especially for wine production, included in Crop and livestock production.",
    "wiki": "",
    "resources": []
  }
]