[
  {
    "name": "Dental studies",
    "description": "Within Health and Welfare / Health, Dental studies involve diagnosing, treating, and preventing diseases and abnormalities of the teeth and gums. It includes designing, making, and repairing dental prostheses and orthodontic appliances, as well as providing assistance to dentists. Public dental health is also covered.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dental assisting",
    "description": "Providing support to dentists during dental procedures, managing patient records, and maintaining dental equipment, a role within Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dental hygiene",
    "description": "The practice of preventive oral health care, including cleaning teeth, examining patients for signs of oral diseases, and providing education on oral health, a key part of Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dental laboratory technology",
    "description": "The design, fabrication, and repair of dental prostheses such as dentures, crowns, and bridges, based on prescriptions from dentists, a specialization within Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dental nursing",
    "description": "Assisting dentists with patient care and clinical procedures, similar to dental assisting, within Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dental science",
    "description": "The scientific study of the oral cavity, teeth, gums, and related structures, as well as oral diseases and their treatment, the foundation of Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dental surgery",
    "description": "Surgical procedures performed on the teeth, gums, jaws, and other oral structures, a specialized area of Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Dental technology",
    "description": "The application of technical skills and knowledge to create and repair dental appliances, synonymous with dental laboratory technology, within Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Odontology",
    "description": "The scientific study of the structure, development, and abnormalities of the teeth, a core component of Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Oral surgery",
    "description": "A branch of dentistry specializing in surgical treatments of the mouth, jaws, and facial structures, within Dental studies.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Orthodontics",
    "description": "The branch of dentistry concerned with the diagnosis, prevention, and correction of malpositioned teeth and jaws, a specialization in Dental studies.",
    "wiki": "",
    "resources": []
  }
]