[
  {
    "name": "Nursing and midwifery",
    "description": "Within Health, Nursing is the study of providing health care for the sick, disabled, or infirm, and assisting medical professionals. Midwifery is the study of providing care to childbearing women during pregnancy, labour, birth, and the postpartum period, including newborn care. Care programmes combining health and social care (e.g., for the elderly) are included here.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Assistant nursing",
    "description": "Providing basic nursing care under the supervision of registered nurses or physicians, a role within Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Basic nursing",
    "description": "Fundamental skills and knowledge required for providing patient care, forming the foundation of nursing practice, within Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "General nursing",
    "description": "Comprehensive nursing care for patients across various age groups and health conditions, a broad area within Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Health care of old people",
    "description": "Specialized nursing care focused on the health needs of elderly individuals, part of Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Heath care of the disabled",
    "description": "Nursing care tailored to individuals with physical or mental disabilities, ensuring their health and well-being, within Nursing and midwifery. (Note: 'Heath' likely a typo in source, should be 'Health').",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Health care programmes",
    "description": "General study programmes focused on providing health care, often with an emphasis on nursing practices, within Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Infant hygiene (nursing)",
    "description": "Nursing practices related to maintaining the health and hygiene of infants, part of Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Midwifery",
    "description": "The health profession that deals with pregnancy, childbirth, and the postpartum period (including care of the newborn), as well as sexual and reproductive health of women throughout their lives, a key component of Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Nursing aide/Orderly",
    "description": "Providing assistance to patients with daily living activities and supporting nursing staff in healthcare settings, a role within Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Psychiatric nursing",
    "description": "Specialized nursing care for individuals with mental health disorders, focusing on their psychological and emotional well-being, within Nursing and midwifery.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Specialised nursing",
    "description": "Nursing practice focused on specific patient populations, health conditions, or areas of care, within Nursing and midwifery.",
    "wiki": "",
    "resources": []
  }
]