[
  {
    "name": "Traditional and complementary medicine and therapy",
    "description": "Within Health, this field is the study of alternative medical systems and practices that are not part of standard Western medical care, but are used alongside or instead of it.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Acupuncture and oriental medicine",
    "description": "A system of traditional medicine originating in China, involving techniques like acupuncture (inserting fine needles into the skin) and herbal remedies, part of Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Aromatherapy",
    "description": "The use of aromatic plant extracts and essential oils for healing and cosmetic purposes, a therapy within Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Ayurvedic medicine",
    "description": "A traditional system of medicine originating in India, emphasizing a holistic approach to health through diet, herbal remedies, yoga, and meditation, part of Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Herbalism",
    "description": "The study and use of medicinal plants to treat diseases and enhance general health and wellbeing, a key component of Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Herbology",
    "description": "Synonymous with Herbalism, focusing on the study and application of herbs for medicinal purposes, within Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Holistic medicine",
    "description": "An approach to healthcare that emphasizes treating the whole person—body, mind, and spirit—rather than just the symptoms of a disease, often incorporating Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Homeopathic medicine",
    "description": "A system of alternative medicine based on the principle of 'like cures like,' using highly diluted substances to stimulate the body's healing processes, part of Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  },
  {
    "name": "Traditional medicine, for example Chinese",
    "description": "Encompasses ancient healing practices and knowledge passed down through generations within various cultures, such as Traditional Chinese Medicine, studied in Traditional and complementary medicine and therapy.",
    "wiki": "",
    "resources": []
  }
]